tutorials/heatTransfer/chtMultiRegionFoam/solarBeamWithTrees/0.orig/air/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    maxY
    {
        type            inletOutlet;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    minX
    {
        type            inletOutlet;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    maxX
    {
        type            inletOutlet;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    minY
    {
        type            inletOutlet;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    maxZ
    {
        type            inletOutlet;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    air_to_floor
    {
        type            kqRWallFunction;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    air_to_solid
    {
        type            kqRWallFunction;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
}


// ************************************************************************* //
